<template>
  <section class="faq">
    <div class="spots">
      <div class="flowers">
        <div class="container">
          <h3>FAQ</h3>
          <FAQ v-for="(faq, i) in faqs" :faq="faq" :index="i" :key="i" />
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import FAQ from "@/components/acordionMain.vue";
export default {
  name: "FaqView",
  components: {
    FAQ,
  },
  data() {
    return {
      faqs: [
        {
          question:
            "ЧИ БУДЕ ЗАМОВЛЕНИЙ БУКЕТ В ТОЧНОСТІ ВІДПОВІДАТИ ЙОГО ЗОБРАЖЕННЯ НА САЙТІ?",
          answer:
            " Букет збирається за індивідуальною матрицею букета. Однак можливі випадки, коли немає необхідних кольорів або наявні квіти відрізняються від представлених на фото, і за узгодженням замовника вони можуть бути замінені на аналогічні. Або якщо флорист вважає, що ці зміни не спричинять сильної зміни в образі букета, то самостійно може замінити деякі квіти. І перед відправкою направляється фото замовнику, який затверджує букет, що вийшов. ",
          open: "false",
        },
        {
          question: "ЯК ДОВГО СТОЯТЬ БУКЕТИ ІЗ СУХОЦВІТІВ?",
          answer:
            "На відміну від живих квітів, які нехай пізно, але все-таки в’януть, сухоцвіти радуватимуть вас дуже довго. Термін зберігання такої композиції – до 3 і більше років. Для такого букета ми підбираємо найстійкіші квіти, які не обсипаються після висихання, зберігають свою форму і навіть аромат.",
          open: "false",
        },
        {
          question: "ЧИ РОБИТЕ ВИ ФОТО ГОТОВОГО БУКЕТУ ПЕРЕД ВІДПРАВКОЮ?",
          answer:
            "  Ми надішлемо вам смс перед відправкою замовлених квітів. Але і при бажанні ви можете замовити фото готового букета по вашій заявці.",
          open: "false",
        },
        {
          question: " А СКІЛЬКИ ПОВИННІ ПРОСТОЯТИ КВІТИ У БУКЕТІ??",
          answer:
            "    Букети можуть швидко пов'янути, якщо їм недостатньо рідини і живильного середовища. Привести букет в колишній вигляд можна, дотримуючись простих рекомендацій. Звичайно, рослини вже не будуть ідеально свіжими, але можна продовжити термін їх життя на кілька днів: Підрізання стеблинок.  Потрібно гострими ножицями або ножем навскоси зробити зріз, завдяки чому стебло буде стояти на дні гострим кінцем, а вода буде надходити вгору до бутонам. Ваза з теплою водою, яка швидше рухається по стеблу, після чого можна повернути в посудину з рідиною кімнатної температури.",
          open: "false",
        },
        {
          question: "ЧИ Є ДОСТАВКА ЗА межі правобережжя?",
          answer:
            "Так, проте ціну та можливість доставки потрібно уточнювати в менеджера.",
          open: "false",
        },
        {
          question: "ЯК ВИЗНАЧИТИ ЧИ СВІЖІ КВІТИ?",
          answer:
            "  Свіжість квітів визначається рівнем насиченості вологою. Чим більше насичені вологою квіти, тим свіжіші вони і тим довше вони будуть стояти. Обережно відігніть пелюстки квітки. Якщо після цього вони приймуть свою початкову форму, - квітка свіжа і добре насичена вологою. Якщо квітка не свіжа, - пелюстки не будуть вертатися на колишнє місце, і стануть в'ялими і слабкими.",
          open: "false",
        },
        {
          question: " ЧИМ ВІДРІЗНЯЄТЬСЯ українська ТРОЯНДА ВІД ІМПОРТНОЇ?",
          answer:
            "   Українські квіти особливі за своєю суттю. Вони мають ніжніші головки, стійке стебло, здатне витримати як спеку, так і холоди, а також неповторний аромат літнього лука. Забарвленн бутонів теж вражають уяву: червоні, білі, рожеві, жовті,помаранчеві, кремові та різнокольорові. Завдяки такому великому вибору можна скомбінувати улюблені кольори одержувача і скласти, наприклад, червоно-білий букет або теплі, осінні золоті відтінки.",
          open: "false",
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>
$lightGreeen-color: #43ffd2;
$pastelPinc-color: #d978ac;
$pastelPinc-colorSpot: #d978ac8b;
$lightGreeen-colorSpot: #43ffd399;

// FAQ PAGE START
.faq {
  .spots {
    padding-bottom: 200px;
    background: 181% 492px/605px 725px no-repeat,
      radial-gradient(
          rgba(61, 82, 121, 0.5) 0,
          transparent 69%,
          transparent 100%
        ) -64% 503px/629px 517px no-repeat,
      radial-gradient(
          rgba(61, 82, 121, 0.5) 0,
          transparent 71%,
          transparent 100%
        )
        181% 492px/605px 725px no-repeat,
      radial-gradient(
          rgba(61, 82, 121, 0.5) 0,
          transparent 69%,
          transparent 100%
        ) -64% 503px/629px 517px no-repeat,
      radial-gradient(
          rgba(61, 82, 121, 0.5) 0,
          transparent 71%,
          transparent 100%
        )
        181% 492px/605px 725px no-repeat;

    background-position: -16% -189px, 108% -18px, 116% 858px, -30% 822px;
  }
  .flowers {
    background-image: url(../assets/images/additional_pages/FAQ/blueFlower.png),
      url(../assets/images/additional_pages/FAQ/blueFlower.png);
    background-repeat: no-repeat;
    background-position: -46% -167px, 124% -117px;
  }
  h3 {
    padding-top: 170px;
    margin-bottom: -28px;
    position: relative;
    padding-left: 100px;
    &::before {
      content: "";
      position: absolute;
      top: 226px;
      left: 0;
      width: 65px;
      height: 1px;
      background-color: $lightGreeen-color;
    }
  }
}
// FAQ PAGE END
</style>
